# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  - [-1, 1, ImageEnhancementBlock, [3]]   # 0
  - [-1, 1, Conv, [64, 3, 2]]             # 1
  - [-1, 1, Conv, [128, 3, 2]]            # 2
  - [-1, 3, C2f, [128, True]]             # 3
  - [-1, 1, Conv, [256, 3, 2]]            # 4 (P3)
  - [-1, 6, C2f, [256, True]]             # 5
  - [-1, 1, Conv, [512, 3, 2]]            # 6 (P4)
  - [-1, 6, C2f, [512, True]]             # 7
  - [-1, 1, Conv, [1024, 3, 2]]           # 8 (P5)
  - [-1, 3, C2f, [1024, True]]            # 9
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 1, ASPPBlock, [1024, "(1,3,6,12)"]]  # 11 ← 문맥 보강(이 위치가 핵심)

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 7], 1, Concat, [1]]                   # 13
  - [-1, 3, C2f, [512]]                          # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 5], 1, Concat, [1]]                   # 16
  - [-1, 3, C2f, [256]]                          # 17

  - [-1, 1, EfficientSEBlock, []]                # 18 ← 저대비/작은 객체 대응
  - [-1, 1, Conv, [256, 3, 2]]                  # 19
  - [[-1, 14], 1, Concat, [1]]                  # 20
  - [-1, 3, C2f, [512]]                          # 21

  - [-1, 1, Conv, [512, 3, 2]]                  # 22
  - [[-1, 11], 1, Concat, [1]]                  # 23
  - [-1, 3, C2f, [1024]]                         # 24
  
  - [[17, 21, 24], 1, Segment, [nc, 32, 256]]   # 25
